[{"model": "MAINAPP.diagnosistool", "pk": 1, "fields": {"tool_name": "AI-Self Diagnosis", "tool_accuracy": "94", "tool_technology": "Support Vector Machine", "tool_detail": "Processed with the powerful AI model trained with SVM. Along with the disease prediction this tool also provide the medication suggestions and precautions corresponding to the disease. Specialized to predict 40+ diseases.", "tool_link": "healthcheckup"}}, {"model": "MAINAPP.diagnosistool", "pk": 2, "fields": {"tool_name": "Diabetes Diagnosis", "tool_accuracy": "90.4", "tool_technology": "Random Forest Algorithm", "tool_detail": "Diabetes is a major cause of blindness, kidney failure, heart attacks, stroke and lower limb amputation. Between 2000 and 2016, there was a 5% increase in premature mortality from diabetes. This diabetes prediction tool comes with eight input fields which is used for diagnosing the presence of diabetes.", "tool_link": "diabetes_risk"}}, {"model": "MAINAPP.diagnosistool", "pk": 3, "fields": {"tool_name": "CVD Diagnosis", "tool_accuracy": "90.5", "tool_technology": "Random Forest Algorithm", "tool_detail": "Manual analysis of data is a lengthy and time consuming and with this tool the CVD can be predicted within seconds providing doctors & specialist with 90.5% of accurate results.", "tool_link": "cvd_prediction"}}, {"model": "MAINAPP.diagnosistool", "pk": 4, "fields": {"tool_name": "Liver Diagnosis", "tool_accuracy": "84", "tool_technology": "Gradient boosting Algorithm", "tool_detail": "Liver Diseases are caused by viruses, such as hepatitis A, hepatitis B, and hepatitis C. An estimated 354 million people worldwide live with hepatitis B or C, and for most, testing and treatment remain beyond reach. This tool is developed with the powerful Gradient boosting Algorithm with an accuracy of 84%.", "tool_link": "liver_diagnosis"}}, {"model": "MAINAPP.diagnosistool", "pk": 5, "fields": {"tool_name": "Brain Tumor", "tool_accuracy": "92", "tool_technology": "Random Forest Algorithm", "tool_detail": "The tool is designed to assist the specialists in detecting brain tumor with the help of MRI extracted features which predict the outcome in seconds by providing the feature input to the prediction tool. Developed with widely used Random Forest Algorithm.", "tool_link": "detect_brain_tumor"}}, {"model": "MAINAPP.diagnosistool", "pk": 6, "fields": {"tool_name": "Mental Health Test", "tool_accuracy": "86", "tool_technology": "Tensorflow", "tool_detail": "If you provide us your information and are in need of support, we will do our best to respond. Please go with our free mental health test. With embedded AI algorithm, we will provide you the feedback within a few seconds.", "tool_link": "mentalhealth"}}]